

namespace Homework_3
{
Задача "Что выведется в консоль и почему?"

    int a = 10;
    int b = 38;
    int c = (31 – 5 * a) / b;
    Console.WriteLine(c);
        В данном примере консоль выведет ответ: 0 так как int целочисленый тип.
        Если заменить тип int символа "с" на тип float то консоль нам выдаст точный результат -0,5.
}
